# What is Sql Subquery?

An SQL subquery is a query part within an SQL query that returns or contains the result of another query.

**Subqueries can be of two main types:**

**Not :** Sample database at the bottom of the article

### 1. Scalar Subquery:

Scalar subqueries are queries that return only a single value (for example, a number, a text, or a date). Typically, such queries are created using a subquery within the SELECT statement.

In [ ]:
-- Lists each customers highest order amount
SELECT customer_name, (
  SELECT MAX(total_amount)
  FROM orders
  WHERE customer_id = customers.customer_id
) AS max_order_amount
FROM customers;

### 2. Table Subquery:

Table subqueries are queries that return a table or a table-like result set. Such subqueries can be used in places like FROM or WHERE.

In [ ]:
-- Lists the products included in a customer's orders
SELECT *
FROM products
WHERE product_id IN (
  SELECT product_id
  FROM orders
  WHERE customer_id = 1
);

SQL subqueries make database queries more readable and understandable, while also helping you create more powerful and flexible queries. Using subqueries, you can filter, group, aggregate data, and perform more complex operations.

## For Examples

### 1. Basic Operations:

#### **- Finding the Highest Value:**

In [ ]:
-- Lists each customer's highest order amount
SELECT customer_name, (
  SELECT MAX(total_amount)
  FROM orders
  WHERE customer_id = customers.customer_id
) AS max_order_amount
FROM customers;

#### - **Finding the Latest Date:**

In [ ]:
-- Lists each customer's last order date
SELECT customer_name, (
  SELECT MAX(order_date)
  FROM orders
  WHERE customer_id = customers.customer_id
) AS last_order_date
FROM customers;

### 2. Filtering:

#### **- Listing Orders After a Specific Date:**

In [ ]:
-- Listing orders after a certain date
SELECT order_id, customer_id, order_date
FROM orders
WHERE order_date > (
  SELECT MAX(order_date)
  FROM orders
);

#### **- Listing Products in Stock:**

In [ ]:
-- Lists products in stock
SELECT product_name, stock_quantity
FROM products
WHERE stock_quantity > 0;

### 3. Joining Two Tables:

#### **- List Details of Orders Made by a Customer:**

In [ ]:
-- List of details of orders made by a customer
SELECT orders.order_id, products.product_name, orders.total_amount
FROM orders
INNER JOIN products ON orders.product_id = products.product_id
WHERE orders.customer_id = (
  SELECT customer_id
  FROM customers
  WHERE customer_name = 'Alice'
);

### 4. Aggregation Processes:

#### **- Customers' Total Number of Orders and Average Amount:**

In [ ]:
-- List each customer's name, total number of orders, and average amount of orders
SELECT customer_name, (
  SELECT COUNT(*)
  FROM orders
  WHERE customer_id = customers.customer_id
) AS order_count, (
  SELECT AVG(total_amount)
  FROM orders
  WHERE customer_id = customers.customer_id
) AS average_amount
FROM customers;

#### **- Finding the Customer Who Orders the Most:**

In [ ]:
-- List of customers who place the most orders
SELECT customer_name
FROM customers
WHERE customer_id = (
  SELECT customer_id
  FROM orders
  GROUP BY customer_id
  ORDER BY COUNT(*) DESC
  LIMIT 1
);

### 5. EXISTS and NOT EXISTS:

EXISTS and NOT EXISTS are used to filter data that meets or does not meet certain conditions using subqueries

#### **- Listing Customers Who Placed At Least One Order (EXISTS):**

In [ ]:
-- List of customers who placed at least one order
SELECT customer_name
FROM customers
WHERE EXISTS (
  SELECT 1
  FROM orders
  WHERE customer_id = customers.customer_id
);

#### **- Listing Customers Who Never Ordered (NOT EXISTS):**

In [ ]:
-- List of customers who have never placed an order
SELECT customer_name
FROM customers
WHERE NOT EXISTS (
  SELECT 1
  FROM orders
  WHERE customer_id = customers.customer_id
);

### 6. IN and NOT IN:

IN and NOT IN are used to filter data that may or may not have certain values ​​using subqueries.

#### **- List Customers Who Purchased a Specific Product (IN):**

In [ ]:
-- List of customers who purchased the product 'Laptop'
SELECT customer_name
FROM customers
WHERE customer_id IN (
  SELECT customer_id
  FROM orders
  WHERE product_id = (
    SELECT product_id
    FROM products
    WHERE product_name = 'Laptop'
  )
);

#### **- ist Customers Who Didn't Buy a Specific Product (NOT IN):**

In [ ]:
-- List of customers who did not purchase the 'Laptop' product
SELECT customer_name
FROM customers
WHERE customer_id NOT IN (
  SELECT customer_id
  FROM orders
  WHERE product_id = (
    SELECT product_id
    FROM products
    WHERE product_name = 'Laptop'
  )
);

### 7. Comparing Subquery Results with Subquery:

#### **- Finding the Customer with the Highest Order Amount:**

In [ ]:
-- List of customers with the highest order amount
SELECT customer_name
FROM customers
WHERE (
  SELECT MAX(total_amount)
  FROM orders
  WHERE customer_id = customers.customer_id
) = (
  SELECT MAX(total_amount)
  FROM orders
);

#### **- List Customers Who Order Above Average:**

In [ ]:
-- List of customers whose orders are above average
SELECT customer_name
FROM customers
WHERE (
  SELECT AVG(total_amount)
  FROM orders
  WHERE customer_id = customers.customer_id
) > (
  SELECT AVG(total_amount)
  FROM orders
);

These examples show how you can use subqueries in SQL to use data to create more complex queries and access more specific results.

## MySQL sample database <a id="MySQL_sample_database"></a>

In [ ]:
--
--  `customers`
--

CREATE TABLE `customers` (
  `customer_id` int(11) NOT NULL,
  `customer_name` varchar(50) DEFAULT NULL,
  `customer_email` varchar(100) DEFAULT NULL,
  `customer_age` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- `customers`
--

INSERT INTO `customers` (`customer_id`, `customer_name`, `customer_email`, `customer_age`) VALUES
(1, 'Alice', 'alice@example.com', 28),
(2, 'Bob', 'bob@example.com', 32),
(3, 'Charlie', 'charlie@example.com', 24),
(4, 'David', 'david@example.com', 29),
(5, 'Emily', 'emily@example.com', 26),
(6, 'Frank', 'frank@example.com', 35),
(7, 'Grace', 'grace@example.com', 31),
(8, 'Helen', 'helen@example.com', 27),
(9, 'Ivan', 'ivan@example.com', 30),
(10, 'Jane', 'jane@example.com', 33),
(11, 'Kevin', 'kevin@example.com', 22),
(12, 'Laura', 'laura@example.com', 25),
(13, 'Mike', 'mike@example.com', 36),
(14, 'Nancy', 'nancy@example.com', 29),
(15, 'Oscar', 'oscar@example.com', 34),
(16, 'Pam', 'pam@example.com', 30),
(17, 'Quinn', 'quinn@example.com', 28),
(18, 'Roger', 'roger@example.com', 31),
(19, 'Sarah', 'sarah@example.com', 27),
(20, 'Tom', 'tom@example.com', 32);

-- --------------------------------------------------------

--
-- `orders`
--

CREATE TABLE `orders` (
  `order_id` int(11) NOT NULL,
  `customer_id` int(11) DEFAULT NULL,
  `product_id` int(11) DEFAULT NULL,
  `order_date` date DEFAULT NULL,
  `total_amount` decimal(10,2) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- `orders`
--

INSERT INTO `orders` (`order_id`, `customer_id`, `product_id`, `order_date`, `total_amount`) VALUES
(1, 1, 2, '2023-09-25', '499.99'),
(2, 3, 6, '2023-09-25', '149.99'),
(3, 5, 8, '2023-09-24', '29.99'),
(4, 7, 3, '2023-09-24', '299.99'),
(5, 9, 10, '2023-09-23', '119.99'),
(6, 2, 7, '2023-09-23', '69.99'),
(7, 4, 5, '2023-09-22', '199.99'),
(8, 6, 1, '2023-09-22', '999.99'),
(9, 8, 4, '2023-09-21', '799.99'),
(10, 10, 9, '2023-09-21', '14.99'),
(11, 11, 1, '2023-09-20', '999.99'),
(12, 13, 3, '2023-09-20', '299.99'),
(13, 15, 6, '2023-09-19', '149.99'),
(14, 9, 7, '2023-09-19', '69.99'),
(15, 19, 10, '2023-09-18', '119.99'),
(16, 12, 2, '2023-09-18', '499.99'),
(17, 14, 4, '2023-09-17', '799.99'),
(18, 15, 5, '2023-09-17', '199.99'),
(19, 18, 8, '2023-09-16', '29.99'),
(20, 20, 9, '2023-09-16', '14.99'),
(21, 1, 1, '2023-09-15', '999.99'),
(22, 3, 3, '2023-09-15', '299.99'),
(23, 5, 5, '2023-09-14', '199.99'),
(24, 7, 7, '2023-09-14', '69.99'),
(25, 9, 9, '2023-09-13', '14.99'),
(26, 2, 2, '2023-09-13', '499.99'),
(27, 4, 4, '2023-09-12', '799.99'),
(28, 6, 6, '2023-09-12', '149.99'),
(29, 8, 8, '2023-09-11', '29.99'),
(30, 10, 10, '2023-09-11', '119.99'),
(31, 11, 2, '2023-09-10', '499.99'),
(32, 13, 4, '2023-09-10', '799.99'),
(33, 15, 6, '2023-09-09', '149.99'),
(34, 12, 8, '2023-09-09', '29.99'),
(35, 19, 10, '2023-09-08', '119.99'),
(36, 12, 1, '2023-09-08', '999.99'),
(37, 14, 3, '2023-09-07', '299.99'),
(38, 16, 5, '2023-09-07', '199.99'),
(39, 18, 7, '2023-09-06', '69.99'),
(40, 20, 9, '2023-09-06', '14.99'),
(41, 1, 10, '2023-09-05', '119.99'),
(42, 3, 2, '2023-09-05', '499.99'),
(43, 5, 4, '2023-09-04', '799.99'),
(44, 7, 6, '2023-09-04', '149.99'),
(45, 9, 8, '2023-09-03', '29.99'),
(46, 2, 10, '2023-09-03', '119.99'),
(47, 4, 1, '2023-09-02', '999.99'),
(48, 6, 3, '2023-09-02', '299.99'),
(49, 8, 5, '2023-09-01', '199.99'),
(50, 10, 7, '2023-09-01', '69.99'),
(51, 11, 9, '2023-08-31', '14.99'),
(52, 13, 2, '2023-08-31', '499.99'),
(53, 15, 4, '2023-08-30', '799.99'),
(54, 19, 6, '2023-08-30', '149.99'),
(55, 19, 8, '2023-08-29', '29.99'),
(56, 12, 10, '2023-08-29', '119.99'),
(57, 14, 1, '2023-08-28', '999.99'),
(58, 16, 3, '2023-08-28', '299.99'),
(59, 18, 5, '2023-08-27', '199.99'),
(60, 20, 7, '2023-08-27', '69.99'),
(61, 1, 9, '2023-08-26', '14.99'),
(62, 3, 2, '2023-08-26', '499.99'),
(63, 5, 4, '2023-08-25', '799.99'),
(64, 7, 6, '2023-08-25', '149.99'),
(65, 9, 8, '2023-08-24', '29.99'),
(66, 2, 10, '2023-08-24', '119.99'),
(67, 4, 1, '2023-08-23', '999.99'),
(68, 6, 3, '2023-08-23', '299.99'),
(69, 8, 5, '2023-08-22', '199.99'),
(70, 10, 7, '2023-08-22', '69.99'),
(71, 11, 9, '2023-08-21', '14.99'),
(72, 13, 2, '2023-08-21', '499.99'),
(73, 15, 4, '2023-08-20', '799.99'),
(74, 15, 6, '2023-08-20', '149.99'),
(75, 19, 8, '2023-08-19', '29.99'),
(76, 12, 10, '2023-08-19', '119.99'),
(77, 14, 1, '2023-08-18', '999.99'),
(78, 16, 3, '2023-08-18', '299.99'),
(79, 18, 5, '2023-08-17', '199.99'),
(80, 20, 7, '2023-08-17', '69.99'),
(81, 1, 9, '2023-08-16', '14.99'),
(82, 3, 2, '2023-08-16', '499.99'),
(83, 5, 4, '2023-08-15', '799.99'),
(84, 7, 6, '2023-08-15', '149.99'),
(85, 9, 8, '2023-08-14', '29.99'),
(86, 2, 10, '2023-08-14', '119.99'),
(87, 4, 1, '2023-08-13', '999.99'),
(88, 6, 3, '2023-08-13', '299.99'),
(89, 8, 5, '2023-08-12', '199.99'),
(90, 10, 7, '2023-08-12', '69.99'),
(91, 11, 9, '2023-08-11', '14.99'),
(92, 13, 2, '2023-08-11', '499.99'),
(93, 15, 4, '2023-08-10', '799.99'),
(94, 20, 6, '2023-08-10', '149.99'),
(95, 19, 8, '2023-08-09', '29.99'),
(96, 12, 10, '2023-08-09', '119.99'),
(97, 14, 1, '2023-08-08', '999.99'),
(98, 16, 3, '2023-08-08', '299.99'),
(99, 18, 5, '2023-08-07', '199.99'),
(100, 20, 7, '2023-08-07', '69.99');

-- --------------------------------------------------------

--
-- `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(50) DEFAULT NULL,
  `unit_price` decimal(10,2) DEFAULT NULL,
  `stock_quantity` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- `products`
--

INSERT INTO `products` (`product_id`, `product_name`, `unit_price`, `stock_quantity`) VALUES
(1, 'Laptop', '999.99', 25),
(2, 'Smartphone', '499.99', 50),
(3, 'Tablet', '299.99', 30),
(4, 'Desktop PC', '799.99', 20),
(5, 'Monitor', '199.99', 40),
(6, 'Printer', '149.99', 15),
(7, 'Headphones', '69.99', 60),
(8, 'Keyboard', '29.99', 75),
(9, 'Mouse', '14.99', 100),
(10, 'External Hard Drive', '119.99', 35);